import os
from datetime import datetime
from unittest.mock import Mock, patch

import pytest
from pydantic_core import ValidationError

from schedule_parser import Parser
from schedule_parser.schemas.lesson import Lesson
from schedule_parser.exceptions.errors import PDFNotFoundError, InvalidPDFError
from schedule_parser.schemas.lesson import lesson_regex, professor_regex, auditory_regex

current_dir = os.path.dirname(__file__)
path_to_mock_pdf = os.path.join(current_dir, 'test.pdf')


def create_date(dat: str) -> datetime:
    day, month = map(int, dat.split('.'))
    year = datetime.today().year
    return datetime(year=year, month=month, day=day)


def test_lesson_regex():
    valid_lessons = [
        'Структуры и алгоритмы обработки данных',
        'ЭВМ и периферийные устройства',
        'Дифференциальные уравнения и ряды',
        'Программирование на языке высокого уровня',
        'Высокоэффективные технологии и оборудование современных производств',
        'Основы военной подготовки',
        'Иностранный язык',
        'История России',
        'Технологии индустрии 4.0',
        'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"',
        'Цифровые технологии 4.0 в машиностроении'
    ]

    for lesson in valid_lessons:
        assert lesson_regex.fullmatch(lesson)


def test_professor_regex():
    valid_professors = [
        'Паничев Н.А.',
        'Дедков И.В.',
        'Петросян Н.С.',
        'Гуриков С.Р.',
        'Власюк Н.Н.',
        'Яцкина А.В.',
        'Новосёлова О.В.',
        'Носовицкий В.Б.',
        'Малова Н.А.',
        'Перетягин П.Ю.'
    ]

    invalid_professors = [
        'Юсеф Farax ',
        'Мягков А.С'
    ]

    for professor in valid_professors:
        assert professor_regex.fullmatch(professor)

    for professor in invalid_professors:
        assert not professor_regex.fullmatch(professor)


def test_auditory_regex():
    valid_auditories = [
        '0410',
        '0801',
        '0806',
        '216',
        '235(в)-ТехП6',
        '235(з)',
        '311',
        '313',
        '409',
        '410',
        'Актовый зал',
        'Стадион 3',
        'Станкин С/З 3',
        'Фрезер 203(КК)',
        'Фрезер 305(ОВП)',
        'Фрезер 402',
        'Фрезер 303 ОВП',
        'ИГ-1',
        'ТехП6(ГПА)',
        'Фрезер С/З 2',
    ]

    invalid_auditories = [
        'Фрезер - ',
        '304-',
        '-3',
        '345/',
        '/3',
        '135.4'
    ]

    for auditory in valid_auditories:
        assert auditory_regex.fullmatch(auditory)

    for auditory in invalid_auditories:
        assert not auditory_regex.fullmatch(auditory)


def test_lesson_validation_error():
    with pytest.raises(ValidationError) as e:
        Lesson(datetime_start=datetime(2025, 12, 21, 16, 10),
               datetime_end=datetime(2025, 12, 21, 15, 50),
               lesson='Иностранный язык\\',
               professor='Косова И.О',
               type='Семинар',
               subgroup=None,
               auditory='Фрезер -',
               group='test')

    assert 'должна быть меньше даты окончания' in str(e.value)
    assert 'Неверный формат названия занятия' in str(e.value)
    assert 'Неверный формат имени преподавателя' in str(e.value)
    assert 'Неверный формат номера аудитории' in str(e.value)


def test_pdf_not_found_error():
    parser = Parser()
    non_existent_path = 'non_exist.pdf'
    with pytest.raises(PDFNotFoundError) as e:
        parser.parse(non_existent_path)

    assert str(e.value) == f'Файл расписания не найден: {non_existent_path}'


@patch('pdfplumber.open')
def test_invalid_pdf_error(mock_pdf_open):
    mock_pdf = Mock()
    mock_page = Mock()
    mock_page.extract_table.return_value = None
    mock_pdf.pages = [mock_page]
    mock_pdf_open.return_value = mock_pdf

    parser = Parser()
    with pytest.raises(InvalidPDFError) as e:
        parser.parse(path_to_mock_pdf)

    assert str(e.value) == 'Не валидный PDF файл'


def test_pdf_parsing():
    parser = Parser()
    result = parser.parse(path_to_mock_pdf)

    test_lessons = [
        'Структуры и алгоритмы обработки данных',
        'ЭВМ и периферийные устройства', 
        'Дифференциальные уравнения и ряды',
        'Программирование на языке высокого уровня',
        'Основы военной подготовки',
        'Иностранный язык',
        'История России'
    ]

    test_professors = [
        'Паничев Н.А.',
        'Дедков И.В.',
        'Петросян Н.С.',
        'Гуриков С.Р.',
        'Власюк Н.Н.',
        'Яцкина А.В.',
        'Новосёлова О.В.',
        'Носовицкий В.Б.',
        'Малова Н.А.'
    ]

    test_auditory = [
        'Фрезер 305(ОВП)',
        'Фрезер 402',
        '235(з)',
        '313',
        '0806',
        '0801',
        '410',
        '409'
    ]

    for lesson in test_lessons:
        assert lesson in [lesson.lesson for lesson in result]
    for professor in test_professors:
        assert professor in [lesson.professor for lesson in result if lesson.professor]
    for auditory in test_auditory:
        assert auditory in [lesson.auditory for lesson in result if lesson.auditory]

    for lesson in result:
        assert lesson.lesson is not None
        assert lesson.type in ['Семинар', 'Лекция', 'Лабораторная']


def test_date_parsing():
    test_dates = ['01.09-15.09 ч.н.',
                  '01.09-02.09 ч.н.',
                  '11.08-11.08 к.н.']
    expected_results = [[create_date('01.09'), create_date('15.09')],
                        [create_date('01.09')],
                        [create_date('11.08')]]
    for test_date, expected in zip(test_dates, expected_results):
        assert Parser.parse_date(test_date) == expected


def test_lesson_parsing():
    test_lessons = [
        'Структуры и алгоритмы обработки данных. Паничев Н.А. Семинар. . [08.09-29.09 к.н.]',
        'ЭВМ и периферийные устройства. Дедков И.В. Семинар. Фрезер 402. [08.09-29.09 к.н.]',
        'Дифференциальные уравнения и ряды. Петросян Н.С. Лекция. . [02.09-21.10 к.н.]',
        'Программирование на языке высокого уровня. Гуриков С.Р. Лабораторная. (Б). 235(з). [21.10]',
        'Высокоэффективные технологии и оборудование современных производств. Перетягин П.Ю. Лабораторная. (А). 235(в)-ТехП6. [11.11-09.12 ч.н.]',
        'Основы военной подготовки. Семинар. Фрезер 305(ОВП). [13.10]',
        'История России. Малова Н.А. Семинар. 409. [10.09-29.10 к.н.]',
        # Тест-кейсы с предметами содержащими "4.0"
        'Технологии индустрии 4.0. Чаруйская М.А. Лекция. . [01.09-17.11 к.н.]',
        'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0". Иванов И.И. Лекция. 101. [01.09-15.12 к.н.]',
        'Цифровые технологии 4.0 в машиностроении. Петров П.П. Семинар. 203. [05.09-10.10 к.н.]'
    ]
    
    expected_results = [
        [(create_date('08.09'), 'Структуры и алгоритмы обработки данных', 'Паничев Н.А.', 'Семинар', None, None, ''),
         (create_date('15.09'), 'Структуры и алгоритмы обработки данных', 'Паничев Н.А.', 'Семинар', None, None, ''),
         (create_date('22.09'), 'Структуры и алгоритмы обработки данных', 'Паничев Н.А.', 'Семинар', None, None, ''),
         (create_date('29.09'), 'Структуры и алгоритмы обработки данных', 'Паничев Н.А.', 'Семинар', None, None, '')],
        [(create_date('08.09'), 'ЭВМ и периферийные устройства', 'Дедков И.В.', 'Семинар', None, 'Фрезер 402', ''),
         (create_date('15.09'), 'ЭВМ и периферийные устройства', 'Дедков И.В.', 'Семинар', None, 'Фрезер 402', ''),
         (create_date('22.09'), 'ЭВМ и периферийные устройства', 'Дедков И.В.', 'Семинар', None, 'Фрезер 402', ''),
         (create_date('29.09'), 'ЭВМ и периферийные устройства', 'Дедков И.В.', 'Семинар', None, 'Фрезер 402', '')],
        [(create_date('02.09'), 'Дифференциальные уравнения и ряды', 'Петросян Н.С.', 'Лекция', None, None, ''),
         (create_date('09.09'), 'Дифференциальные уравнения и ряды', 'Петросян Н.С.', 'Лекция', None, None, ''),
         (create_date('16.09'), 'Дифференциальные уравнения и ряды', 'Петросян Н.С.', 'Лекция', None, None, ''),
         (create_date('23.09'), 'Дифференциальные уравнения и ряды', 'Петросян Н.С.', 'Лекция', None, None, ''),
         (create_date('30.09'), 'Дифференциальные уравнения и ряды', 'Петросян Н.С.', 'Лекция', None, None, ''),
         (create_date('07.10'), 'Дифференциальные уравнения и ряды', 'Петросян Н.С.', 'Лекция', None, None, ''),
         (create_date('14.10'), 'Дифференциальные уравнения и ряды', 'Петросян Н.С.', 'Лекция', None, None, ''),
         (create_date('21.10'), 'Дифференциальные уравнения и ряды', 'Петросян Н.С.', 'Лекция', None, None, '')],
        [(create_date('21.10'), 'Программирование на языке высокого уровня', 'Гуриков С.Р.', 'Лабораторная', 'Б', '235(з)', '')],
        [(create_date('11.11'), 'Высокоэффективные технологии и оборудование современных производств', 'Перетягин П.Ю.', 'Лабораторная', 'А', '235(в)-ТехП6', ''),
         (create_date('25.11'), 'Высокоэффективные технологии и оборудование современных производств', 'Перетягин П.Ю.', 'Лабораторная', 'А', '235(в)-ТехП6', ''),
         (create_date('09.12'), 'Высокоэффективные технологии и оборудование современных производств', 'Перетягин П.Ю.', 'Лабораторная', 'А', '235(в)-ТехП6', '')],
        [(create_date('13.10'), 'Основы военной подготовки', None, 'Семинар', None, 'Фрезер 305(ОВП)', '')],
        [(create_date('10.09'), 'История России', 'Малова Н.А.', 'Семинар', None, '409', ''),
         (create_date('17.09'), 'История России', 'Малова Н.А.', 'Семинар', None, '409', ''),
         (create_date('24.09'), 'История России', 'Малова Н.А.', 'Семинар', None, '409', ''),
         (create_date('01.10'), 'История России', 'Малова Н.А.', 'Семинар', None, '409', ''),
         (create_date('08.10'), 'История России', 'Малова Н.А.', 'Семинар', None, '409', ''),
         (create_date('15.10'), 'История России', 'Малова Н.А.', 'Семинар', None, '409', ''),
         (create_date('22.10'), 'История России', 'Малова Н.А.', 'Семинар', None, '409', ''),
         (create_date('29.10'), 'История России', 'Малова Н.А.', 'Семинар', None, '409', '')],
        [(create_date('01.09'), 'Технологии индустрии 4.0', 'Чаруйская М.А.', 'Лекция', None, None, ''),
         (create_date('08.09'), 'Технологии индустрии 4.0', 'Чаруйская М.А.', 'Лекция', None, None, ''),
         (create_date('15.09'), 'Технологии индустрии 4.0', 'Чаруйская М.А.', 'Лекция', None, None, ''),
         (create_date('22.09'), 'Технологии индустрии 4.0', 'Чаруйская М.А.', 'Лекция', None, None, ''),
         (create_date('29.09'), 'Технологии индустрии 4.0', 'Чаруйская М.А.', 'Лекция', None, None, ''),
         (create_date('06.10'), 'Технологии индустрии 4.0', 'Чаруйская М.А.', 'Лекция', None, None, ''),
         (create_date('13.10'), 'Технологии индустрии 4.0', 'Чаруйская М.А.', 'Лекция', None, None, ''),
         (create_date('20.10'), 'Технологии индустрии 4.0', 'Чаруйская М.А.', 'Лекция', None, None, ''),
         (create_date('27.10'), 'Технологии индустрии 4.0', 'Чаруйская М.А.', 'Лекция', None, None, ''),
         (create_date('03.11'), 'Технологии индустрии 4.0', 'Чаруйская М.А.', 'Лекция', None, None, ''),
         (create_date('10.11'), 'Технологии индустрии 4.0', 'Чаруйская М.А.', 'Лекция', None, None, ''),
         (create_date('17.11'), 'Технологии индустрии 4.0', 'Чаруйская М.А.', 'Лекция', None, None, '')],
        [(create_date('01.09'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('08.09'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('15.09'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('22.09'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('29.09'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('06.10'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('13.10'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('20.10'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('27.10'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('03.11'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('10.11'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('17.11'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('24.11'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('01.12'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('08.12'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', ''),
         (create_date('15.12'), 'Формирование единой информационной среды предприятия на основе концепции "Качество 4.0"', 'Иванов И.И.', 'Лекция', None, '101', '')],
        [(create_date('05.09'), 'Цифровые технологии 4.0 в машиностроении', 'Петров П.П.', 'Семинар', None, '203', ''),
         (create_date('12.09'), 'Цифровые технологии 4.0 в машиностроении', 'Петров П.П.', 'Семинар', None, '203', ''),
         (create_date('19.09'), 'Цифровые технологии 4.0 в машиностроении', 'Петров П.П.', 'Семинар', None, '203', ''),
         (create_date('26.09'), 'Цифровые технологии 4.0 в машиностроении', 'Петров П.П.', 'Семинар', None, '203', ''),
         (create_date('03.10'), 'Цифровые технологии 4.0 в машиностроении', 'Петров П.П.', 'Семинар', None, '203', ''),
         (create_date('10.10'), 'Цифровые технологии 4.0 в машиностроении', 'Петров П.П.', 'Семинар', None, '203', '')]
    ]
    
    for test_lesson, expected in zip(test_lessons, expected_results):
        result = Parser.items(test_lesson)
        assert result == expected
